In [1]:
import pandas as pd
import numpy as np 
import datetime as dt
import re

# <u>Useful pandas settings </u>

In [2]:
# disp all columns 
pd.set_option('display.max_columns', None)
# disp n rows 
pd.set_option('display.max_columns', 5)

# <u>Basic DataFrame Manipulation </u>

 ### Filter based on column value

In [3]:
accomodation = pd.read_csv("accomodation.csv")

In [4]:
accomodation.head(2)

                       name          city country_code  size
0         Pensiunea Sovirag           Sic           ro    16
1  Bio-Vitalhotel Falkenhof  Bad FĂĽssing           de    42

In [5]:

france = accomodation.loc[accomodation["country_code"] == "fr",['name','size']]
france.head()

                             name  size
12                 Le PrĂ© du Lac    60
24         La Maison d'Hoursentut    13
46   HĂ´tel-Restaurant de La Paix    27
57       Premiere Classe Les Ulis    64
106                      Eterlous    16

 ### Apply a transformation to all cells of data set

In [6]:
france = france.applymap(lambda cell: len(str(cell)))
france.head()

     name  size
12     14     2
24     22     2
46     28     2
57     24     2
106     8     2

 ### Return a value on a series based on another series

In [7]:
accomodation = pd.read_csv("accomodation.csv")

In [8]:
accomodation.head()

                       name                   city country_code  size
0         Pensiunea Sovirag                    Sic           ro    16
1  Bio-Vitalhotel Falkenhof           Bad FĂĽssing           de    42
2              Duvan Hotell                Uppsala           se    32
3              Wessex Hotel  Street Nr Glastonbury           gb    50
4          Alexandria Hotel           Thessaloniki           gr    28

In [9]:
# method 1 -> using loc --> easy if just need one value returned
accomodation["range"]=""
accomodation.loc[(accomodation["size"] > 12) & (accomodation["size"] < 30), "range"] = "Small"

In [10]:
accomodation

,name,city,country_code,size,range
0,Pensiunea Sovirag,Sic,ro,16,Small
1,Bio-Vitalhotel Falkenhof,Bad FĂĽssing,de,42,
2,Duvan Hotell,Uppsala,se,32,
3,Wessex Hotel,Street Nr Glastonbury,gb,50,
4,Alexandria Hotel,Thessaloniki,gr,28,Small
...,...,...,...,...,...
495,Casa Grande Boutique Hotel,Ciudad Bolivar,ve,15,Small
496,CabaĂ±as Arepo - Barrancas de Lolita,Areponapuchi,mx,12,
497,Lanting Inn,Dunhuang,cn,13,Small
498,Hotel Belveder,Pag,hr,26,Small
499,Hotel Agli Olmi,San Biagio Di Callalta,it,24,Small

In [11]:
# method 2 -> using function --> better way. 
# you don't have to define the function per say, you could include it into the apply
def calculate_size(size): 
    if size > 150: 
        x = "very big" 
    elif size < 150 and size >= 100: 
        x = "big"
    elif size < 100 and size >= 30:
        x="medium"
    else: 
        x = "Small" 
    return x

accomodation["range2"] = accomodation.apply(lambda row: calculate_size(row["size"]), axis=1)

In [12]:
accomodation

,name,city,...,range,range2
0,Pensiunea Sovirag,Sic,...,Small,Small
1,Bio-Vitalhotel Falkenhof,Bad FĂĽssing,...,,medium
2,Duvan Hotell,Uppsala,...,,medium
3,Wessex Hotel,Street Nr Glastonbury,...,,medium
4,Alexandria Hotel,Thessaloniki,...,Small,Small
...,...,...,...,...,...
495,Casa Grande Boutique Hotel,Ciudad Bolivar,...,Small,Small
496,CabaĂ±as Arepo - Barrancas de Lolita,Areponapuchi,...,,Small
497,Lanting Inn,Dunhuang,...,Small,Small
498,Hotel Belveder,Pag,...,Small,Small
499,Hotel Agli Olmi,San Biagio Di Callalta,...,Small,Small

 ### Map a dataframe with a dimension table

In [13]:
accomodation = pd.read_csv("accomodation.csv")
country_code_dimension = pd.read_csv("country_code.csv")

In [14]:
accomodation.head()

                       name                   city country_code  size
0         Pensiunea Sovirag                    Sic           ro    16
1  Bio-Vitalhotel Falkenhof           Bad FĂĽssing           de    42
2              Duvan Hotell                Uppsala           se    32
3              Wessex Hotel  Street Nr Glastonbury           gb    50
4          Alexandria Hotel           Thessaloniki           gr    28

In [15]:
country_code_dimension.head()

             Name Code
0     Afghanistan   AF
1   Aland Islands   AX
2         Albania   AL
3         Algeria   DZ
4  American Samoa   AS

In [16]:

# column that needs to be mapped as index
country_code_dimension.set_index('Code', inplace= True)
#transform df into dictionary 
country_code_dimension = country_code_dimension.to_dict()

In [17]:
accomodation['country'] = accomodation["country_code"].str.upper().map(country_code_dimension['Name']) 
#use map function to map dimension table with ["country_code"] column of accomodation dataframe. 
#Don't forget to capitalize, you need a perfect string match

In [18]:
accomodation

,name,city,country_code,size,country
0,Pensiunea Sovirag,Sic,ro,16,Romania
1,Bio-Vitalhotel Falkenhof,Bad FĂĽssing,de,42,Germany
2,Duvan Hotell,Uppsala,se,32,Sweden
3,Wessex Hotel,Street Nr Glastonbury,gb,50,United Kingdom
4,Alexandria Hotel,Thessaloniki,gr,28,Greece
...,...,...,...,...,...
495,Casa Grande Boutique Hotel,Ciudad Bolivar,ve,15,"Venezuela, Bolivarian Republic of"
496,CabaĂ±as Arepo - Barrancas de Lolita,Areponapuchi,mx,12,Mexico
497,Lanting Inn,Dunhuang,cn,13,China
498,Hotel Belveder,Pag,hr,26,Croatia
499,Hotel Agli Olmi,San Biagio Di Callalta,it,24,Italy

# <u> Pandas and DateTime</u>

 ### Convert series to datetime format

In [19]:
import datetime as dt

In [20]:
data = [["13/02/1986", "Jim was born"], ["16-07-09" ,"Jim got married"], ["19/10/2020","Jim had a child"], [ "09-12-2054", "Jim died"] ]


jim = pd.DataFrame(data, columns = ['Date', 'Lifeof Jim'])
jim

         Date       Lifeof Jim
0  13/02/1986     Jim was born
1    16-07-09  Jim got married
2  19/10/2020  Jim had a child
3  09-12-2054         Jim died

In [21]:
jim["Date"] = pd.to_datetime(jim['Date'])
jim

        Date       Lifeof Jim
0 1986-02-13     Jim was born
1 2009-07-16  Jim got married
2 2020-10-19  Jim had a child
3 2054-09-12         Jim died

 ### Extract a specific unit from datetime

In [22]:
jim['Year'] = jim['Date'].dt.year # returns as an int
jim["Month"] = jim["Date"].dt.strftime("%B") # returns as a string
print(jim.head())
print(jim.dtypes)

        Date       Lifeof Jim  Year      Month
0 1986-02-13     Jim was born  1986   February
1 2009-07-16  Jim got married  2009       July
2 2020-10-19  Jim had a child  2020    October
3 2054-09-12         Jim died  2054  September
Date          datetime64[ns]
Lifeof Jim            object
Year                   int64
Month                 object
dtype: object

# <u> Manipulating Strings </u>

 ### Replacing strings in a series from a dictionary

In [23]:
mispelled_data = pd.read_csv("mispelled_data.csv") ## dataframe with lots of mispelled data (usually repeated mispells)
string_correction = pd.read_csv("string_correction.csv") ## dataframe wih corrections

In [24]:
mispelled_data.head()

                            mispelled_string
0                                      candi
1                       helo my name is Jeff
2     we are going to San Francesco tomorrow
3                        I like to eate piza
4  I need to read more bookes to spel better

In [25]:
string_correction.head()

    wrong_string   right_string
0          candi          candy
1           helo          hello
2  San Francesco  San Francisco
3           eate            eat
4           piza          pizza

In [26]:
string_correction = string_correction.set_index("wrong_string") # set wrong string as index
string_correction = string_correction.to_dict() #tranform df into dic

In [27]:
def find_replace(string): #define functions that replaces wrong string by right string
    for item in string_correction['right_string'].keys():
        # sub item for item's paired value in dictionary
        string = re.sub(item, string_correction['right_string'][item], string)
    return string

In [29]:
mispelled_data['rightly_spelled_string'] =\
                     mispelled_data.apply(lambda row:\
                     find_replace(str(row["mispelled_string"])),\
                     axis=1) # apply function to mispelled string series

In [30]:
mispelled_data ## strings are replaced!

,mispelled_string,rightly_spelled_string
0,candi,candy
1,helo my name is Jeff,hello my name is Jeff
2,we are going to San Francesco tomorrow,we are going to San Francisco tomorrow
3,I like to eate piza,I like to eat pizza
4,I need to read more bookes to spel better,I need to read more books to spel better

 ### "If contains" algorithm

In [31]:
# Here we are trying to format a name that can be written in multiple ways.
# We have a dictionary that tells us which strings can correspond to a specific brand name
# we need to write a function that returns the brand name in a new column if the original name contains a specific string
# several strings can return the same brand name


data = [["mcdonalds central london", ""], ["pizza hut downtown new york" ,""], ["dominos new jersey",""], [ "mac donald berlin", ""] ]

restaurants = pd.DataFrame(data, columns = ['restaurant_name', 'brand_name'])
    
brand_dictionary = {
"mcdonalds" : "McDonald's",
"mac donald" : "McDonald's",
"dominos" : "Dominos Pizza",
"pizza hut" : "Pizza Hut"}

def get_name(restaurant, dct):
    for r in dct:
        if r in restaurant:
            return dct[r]
    return '-'

restaurants['brand_name'] = restaurants['restaurant_name'].apply(lambda x: get_name(x, brand_dictionary))
restaurants

               restaurant_name     brand_name
0     mcdonalds central london     McDonald's
1  pizza hut downtown new york      Pizza Hut
2           dominos new jersey  Dominos Pizza
3            mac donald berlin     McDonald's

### Word Counter

In [32]:
from collections import Counter
accomodation = pd.read_csv("accomodation.csv")
accomodation.head()

                       name                   city country_code  size
0         Pensiunea Sovirag                    Sic           ro    16
1  Bio-Vitalhotel Falkenhof           Bad FĂĽssing           de    42
2              Duvan Hotell                Uppsala           se    32
3              Wessex Hotel  Street Nr Glastonbury           gb    50
4          Alexandria Hotel           Thessaloniki           gr    28

In [33]:
#use counter to store number of times a string is returned in an object
word_count = Counter(' '.join(accomodation['name']).split(' ')).items()

In [34]:
word_count

dict_items([('Pensiunea', 1), ('Sovirag', 1), ('Bio-Vitalhotel', 1), ('Falkenhof', 1), ('Duvan', 1), ('Hotell', 2), ('Wessex', 1), ('Hotel', 205), ('Alexandria', 1), ('HotelovĂ˝', 1), ('resort', 1), ('Ĺ\xa0ikland', 1), ('Markets', 1), ('Residence', 4), ('Inn', 51), ('Houston', 1), ('Medical', 1), ('Center', 4), ('/', 3), ('NRG', 1), ('Park', 6), ('Sea', 1), ('View', 5), ('Heights', 1), ('Villa', 7), ('Montego', 1), ('Bay', 3), ('YangShuo', 1), ('Eden', 1), ('YHA', 1), ('Casablanca', 1), ('Palace', 4), ('Sagar', 1), ('Le', 7), ('PrĂ©', 1), ('du', 3), ('Lac', 1), ('Dionyssos', 1), ("Rantun's", 1), ('Place', 1), ('The', 21), ('Gateway', 3), ('M', 1), ('G', 1), ('Road', 3), ('NH', 1), ('Collection', 1), ('Victoria', 3), ('Raoum', 1), ("Innkeeper's", 1), ('Lodge', 8), ('Doncaster,', 1), ('Bessacarr', 1), ('Pivnice', 1), ('ve', 1), ('Dvorci', 1), ('-', 11), ('JĂ\xadtrava', 1), ('Jiayou', 1), ('travel', 1), ('leisure', 1), ('hostel', 1), ('Grafs', 1), ('Adler', 1), ('Don', 1), ('Rodrigo', 1), ('Pearl', 2), ('on', 2), ('the', 1), ('Concho', 1), ('at', 5), ('Jameson', 1), ('La', 11), ('Maison', 1), ("d'Hoursentut", 1), ('Shanhai-Blues', 1), ('Pension', 3), ('Tip-Top', 1), ('Zhangzhou', 1), ('Huayuan', 1), ('Embassy', 1), ('Suites', 20), ('Colorado', 1), ('Springs', 2), ("Louis'", 1), ('Tavern', 2), ('Transit', 1), ('Dayrooms', 1), ('Suvarnabhumi', 1), ('Airport', 7), ('A', 3), ('Beach', 11), ('Retreat', 2), ('Casey', 1), ('Key', 1), ('Rossola', 1), ('Resort', 22), ('Morada', 1), ('da', 1), ('Praia', 2), ('do', 1), ('Rosa', 1), ('Pousada', 5), ('Oblu', 1), ('by', 3), ('Atmosphere', 1), ('Helengeli', 1), ('Lia', 1), ('Studios', 1), ('Elan', 1), ('Chengdu', 2), ('Shijicheng', 1), ('Treasure', 1), ('Cove', 1), ('Cilnia', 1), ('Relais', 1), ('&', 26), ('Spa', 11), ('Quality', 3), ('Manchester', 1), ('Casa', 5), ('Roja', 1), ('Hostel', 7), ('Seeds', 1), ('Setia', 1), ('Wangsa', 1), ('Baymont', 2), ('Mobile', 1), ('Dal', 2), ('Ponte', 1), ('Axis', 1), ('Vermar', 1), ('Conference', 2), ('Orion', 1), ('HotĂ©is', 1), ('HĂ´tel-Restaurant', 1), ('de', 8), ('Paix', 1), ('BelAire', 1), ('Bangkok', 2), ('Royalton', 1), ('Hotels', 1), ('Limited', 1), ('Damnak', 1), ('Suon', 1), ('Angkor', 1), ('Poplar', 1), ('Sanctuary', 1), ('Apartments', 7), ('Dawson', 1), ('and', 10), ("Reindl's", 1), ('Partenkirchener', 1), ('Hof', 2), ('Hazyview', 1), ('Adventure', 1), ('Backpackers', 1), ('Ivan', 1), ('Om', 1), ('Executive', 1), ('Ferma', 1), ('Veche', 1), ('Bogdana', 1), ('Premiere', 1), ('Classe', 2), ('Les', 4), ('Ulis', 1), ('Marriottâ€™s', 1), ('Waikoloa', 1), ('Ocean', 3), ('Club', 3), ('Apartahotel', 1), ('Aguadulce', 1), ('Pensjonat', 1), ('DwĂłr', 1), ('Szlachecki', 1), ('BiedaczĂłw', 1), ('Orein', 1), ('Home', 3), ('Yorkton', 1), ('Vogel', 1), ('Appartement', 1), ('Tuna', 1), ('Hilton', 3), ('Concord', 1), ('GreenTree', 1), ('Jiangsu', 1), ('Wuxi', 1), ('Taihu', 1), ('Lake', 5), ('Business', 2), ('Biryuza-Yug', 1), ('Baza', 1), ('Otdykha', 1), ('Zhuhai', 1), ('Qindao', 1), ('Elite', 1), ('San', 4), ('LĂˇzaro', 1), ('Boutique', 7), ('Su', 1), ('Apartment', 3), ('Hotel-Restaurant', 1), ('KrĂĽger', 1), ('Howard', 1), ('Johnson', 1), ('Central', 3), ('Rayentray', 1), ('Tropicalis', 1), ('Slim', 1), ('Mercure', 1), ('Istanbul', 1), ('Orka', 1), ('Apartamentos', 4), ('Honorio', 1), ('Xiamen', 1), ('Rushi', 1), ('(Exposition', 1), ('Branch)', 1), ('Portview', 1), ('Playa', 1), ('Dearly', 1), ('Koh', 2), ('Tao', 1), ('Albergo', 1), ('larice', 1), ('Bianco', 1), ('Mist', 1), ('Heaven', 1), ('Hill', 1), ('Crown', 3), ('Viceroy', 1), ('Riviera', 2), ('Maya', 1), ('Renomme', 1), ('Punta', 1), ('Teonoste', 1), ('Terme', 1), ('GaĂ§e', 1), ('Alte', 1), ('Post', 1), ('Ashford', 1), ('Court', 3), ('Viktoria', 1), ('Vasantham', 1), ('Gibson', 1), ('City', 8), ('Loft', 1), ('PacĂ\xadfico', 1), ('Socrates', 1), ('Tianbao', 1), ('International', 2), ('Budget', 1), ('Stockton', 1), ('Yosemite', 1), ('EcoHotel', 1), ('Itzamaltun', 1), ('Avenida', 1), ('Mountain', 3), ('Lodges', 1), ('Saalbach', 1), ('Alpin', 1), ('Rentals', 1), ('Sharq', 1), ('Village', 6), ('Spa,', 1), ('a', 2), ('Ritz-Carlton', 1), ('Langham', 1), ('Huntington,', 1), ('Pasadena', 1), ('SONATA', 1), ('Eterlous', 1), ('Alfa', 1), ('Scholars', 1), ('Resorts', 3), ('Suzhou', 1), ('Rooms', 2), ('Misirlije', 1), ('Clarion', 2), ('Convention', 1), ('Baraboo', 1), ('Zanzibar', 1), ('White', 3), ('Sand', 1), ('Luxury', 1), ('Villas', 2), ('Kennewick', 1), ('Best', 4), ('HK', 1), ('Nathan', 1), ('House', 7), ('Manumea', 1), ('Pasumalai', 1), ('Madurai', 1), ('First', 1), ('Mortensen', 1), ('Atlas', 1), ('H.K', 1), ('Commercial', 1), ('Scauri', 1), ('Colors', 1), ('Canada', 1), ('Plaza', 4), ('Colon', 1), ('Grande', 2), ('Artina', 1), ('OYO', 1), ('Chandigarh', 1), ('Railway', 1), ('Station', 3), ('Hotel-Landgasthof', 1), ('Stranachwirt', 1), ('cu', 1), ('Tei', 1), ('BAL', 1), ('Royal', 4), ('Caleta', 1), ('Dorada', 1), ('One', 2), ('Reynosa', 1), ('Valle', 1), ('Alto', 1), ('Pierre', 1), ('Vacances', 1), ('Premium', 2), ('Rives', 1), ('Cannes', 1), ('Mandelieu', 1), ('Palais', 1), ('Atrium', 1), ('Apartamenty', 1), ('Liget', 1), ('Wellness', 1), ('Ă©s', 2), ('Konferencia', 1), ('Shenzhen', 1), ('Caopu', 1), ('Metro', 1), ('Motor', 3), ('Wanganui', 1), ('und', 2), ('Weingut', 1), ('KarlsmĂĽhle', 1), ('Hampton', 4), ('Washington', 1), ('Maruei', 1), ('DeLuna', 1), ('Diving', 1), ('Sim-Er', 1), ('Goldener', 1), ('Anker', 1), ('Boathouse', 2), ('Suanphung', 1), ('Luna', 3), ('Blanca', 1), ('SPA', 1), ('Homewood', 2), ('Grand', 4), ('Rapids', 1), ('Folgore', 1), ('Max', 1), ('Savassi', 1), ('Apart', 3), ('Service', 2), ('Western', 3), ('Tunica', 1), ('Seven', 1), ('Zhangjiajie', 1), ('Weiyi', 1), ('Fashion', 1), ('Gaustatoppen', 1), ('Booking', 1), ('Lighthouse', 1), ('Cape', 1), ('Cod', 1), ('Embat', 1), ('Polis', 1), ('Forenom', 1), ('Tampere', 1), ('Seehotel', 1), ('Schlierseer', 1), ('Buenos', 1), ('Aires', 1), ('Melrose', 1), ('Benz', 1), ('Tre', 1), ('Liljor', 1), ('Marin', 1), ('Silence', 1), ('Canaima', 1), ('Wittenberg', 1), ('Flamingo', 1), ('Safari', 1), ('Campsite', 1), ('Joyosa', 1), ('Guarda', 1), ('Pullman', 1), ('Liverpool', 1), ('Express', 3), ('Puebla', 1), ('FINSA', 1), ('Pensione', 1), ('Svizzera', 1), ('Vacation', 1), ('Bonaventure', 1), ('Phenix', 1), ('City-', 1), ('Columbus', 1), ('Area', 2), ('Pasike', 1), ('Rafting', 1), ('Drina', 1), ('Tara', 1), ('Sanya', 1), ('Hua', 1), ('Ting', 1), ('Zhu', 1), ('Ti', 1), ("L'Eden", 1), ("Martin's", 1), ('Brussels', 1), ('EU', 1), ('UdumĂ¤e', 1), ('Holiday', 3), ('Farm', 2), ('Santa', 1), ('Lucia', 1), ('Crompton', 1), ('Atlanta', 1), ('Midtown', 2), ('Tryp', 1), ('Malaga', 1), ('Guadalmar', 1), ('Guam', 1), ('Reef', 1), ('Olive', 1), ('Gyeongju', 1), ('Tour', 2), ('Guest', 3), ('Nice', 1), ('Anwar', 1), ('Al', 1), ('Habeeb', 1), ('Bournemouth', 1), ('Asia', 1), ('Artemis', 1), ('Suit', 1), ('Ä°stanbul', 1), ('Shanghai', 2), ('Songjiang', 1), ('Jiutin', 1), ('Jiudu', 1), ('Toyoko', 2), ('JR', 1), ('Kobe-eki', 1), ('Kita-guchi', 1), ('Restaurant', 4), ('la', 2), ('Deville', 1), ('Moena', 1), ('Southview', 1), ('Motel', 5), ('Vila', 1), ('Hibisco', 1), ('e', 1), ('Lautrec', 1), ('Opera', 1), ('Fryderyk', 1), ('Taleju', 1), ('Tuti', 1), ('Bororo', 1), ('Murataya', 1), ('Postumia', 1), ('Design', 1), ('Miami', 2), ('Sun', 1), ('Downtown/Port', 1), ('of', 2), ('Hosteria', 2), ('Chalp', 1), ('Gran', 1), ('Chalet', 4), ('Petit', 1), ('Thon', 1), ('Harstad', 1), ('Conjunto', 1), ('Residencial', 1), ('Las', 1), ('Calas', 1), ('Irida', 1), ('Days', 2), ('Simeon', 1), ('Itapira', 1), ('Forest', 1), ('Grove', 1), ('Multan', 1), ('HĂ´tel', 6), ('Saint-Hubert', 1), ('Fallowfield', 1), ('Country', 3), ('College', 1), ('Romantik', 1), ('der', 1), ('Wiesenhof', 1), ('Sanotel', 1), ('Angelo', 1), ('Samaru', 1), ('Novotel', 1), ('Edinburgh', 1), ('Centre', 3), ('Chalets', 1), ('Villard', 1), ('Jackson', 2), ('Kamer', 1), ('Suite', 2), ('Polo', 1), ('Towers', 1), ('By', 1), ('Diamond', 1), ('Jiamenxin', 1), ('Torreon', 1), ('Aparthotel', 1), ('Seidel', 1), ('Garni', 2), ('Puteri', 1), ('Bayu', 1), ('Hoa', 1), ('Lu', 1), ('Stella', 1), ('Maris', 1), ('Realminas', 1), ('C.Courtesy', 1), ('Eastin', 1), ('Residences', 1), ('Muscat', 1), ('Inkarri', 1), ('Hostal', 3), ('Ashnil', 1), ('Mara', 1), ('Camp', 2), ('Kinosaki', 1), ('Yamamotoya', 1), ('Scandic', 1), ('TĂ¤by', 1), ('Tonle', 1), ('Sap', 1), ('Deniliquin', 1), ('Saroma', 1), ('Tsuruga', 2), ('Staybridge', 1), ('Plano', 1), ('Frisco', 1), ('Leamira', 1), ('Kas', 1), ('PapĂ\xadĂ\xad', 1), ('Departamentos', 2), ('Temporarios', 1), ('Mirror', 1), ('Touch', 1), ('Alpenhof', 1), ('Marina', 1), ("Ranjit's", 1), ('Svaasa', 1), ('Amritsar', 1), ('Aurora', 1), ('Landgasthof', 1), ('Auenhof', 1), ('Broadwater', 1), ('Valencia', 1), ('Suits', 1), ('You', 1), ('B&B', 1), ('Schlosspark', 1), ('Mauerbach', 1), ('Evotel', 1), ('Adonis', 1), ('Bayonne', 1), ('Lakeside', 2), ('Leisure', 1), ('Camping', 2), ('Sion', 1), ('Jomtien', 1), ('Doha', 1), ('Liuzhou', 1), ('Qiantai', 1), ('Hanting', 2), ('Hangzhou', 1), ('Huanglong', 1), ('Nature', 1), ('Heritage', 1), ('Eaka', 1), ('365', 1), ('South', 1), ('Jianhua', 1), ('Zhongmei', 1), ('Branch', 2), ('Bonita', 1), ('Risveglio', 1), ('Akasaka', 1), ('Thistle', 1), ('Trafalgar', 2), ('Square,', 1), ('PremiĂ¨re', 1), ('Colmar', 1), ('Nord', 1), ('Houssen', 1), ('Serenity', 1), ('Bedouin', 1), ('Wadi', 1), ('Rum', 1), ('Imperial', 1), ('Dynasty', 1), ('Gure', 1), ('Echea', 1), ('Como', 1), ('Noosa', 1), ('Atithi', 1), ('galaxy', 1), ('Plazza', 1), ('Palacio', 1), ('Chatino', 1), ('Majestic', 1), ('Bellevue', 2), ('Excelsior', 1), ('Sleeping', 1), ('Ute', 1), ('Deep', 1), ('Blue', 1), ('7Days', 1), ('Bijie', 1), ('District', 1), ('Xiaoshizi', 1), ('Soleil', 1), ('Saint-Tropez', 1), ('Aliante', 1), ('Casino', 1), ('+', 1), ('Huangshan', 1), ('Zhaojian', 1), ('Maridin', 1), ('Olympos', 1), ('Manfredi', 1), ('In', 1), ('Rome', 1), ('AmericInn', 1), ('Fergus', 1), ('Falls', 2), ('Mack', 1), ('Norfolk', 1), ('Broads', 1), ('MIKE', 1), ('Plus', 1), ('Bostanci', 1), ('Atasehir', 1), ('Shkodra', 1), ('KM', 1), ('Zero', 1), ('Quellenhof', 1), ('Bosque', 1), ('dos', 1), ('AruĂŁs', 1), ('Marble', 1), ('AMA', 1), ('Andalucia', 1), ('Jetwing', 1), ('Lagoon', 1), ('Sunbelt', 1), ('Horse', 1), ('Cave', 1), ('Bali', 3), ('Indah', 1), ('Aroma', 1), ('Nha', 1), ('Trang', 1), ('Waimea', 1), ('Plantation', 1), ('Cottages,', 1), ('Coast', 1), ('Sullana', 1), ('Haus', 1), ('Breer', 1), ('Roma', 1), ('Inland', 1), ('Kohan', 1), ('No', 2), ('Yado', 1), ('Yoshidaya', 1), ('Amigdalies', 1), ('Johannes', 1), ('Vermeer', 1), ('Delft', 1), ('ChĂ˘teau', 1), ('Saint-Martin', 1), ('Malibu', 1), ('Somogy', 1), ('Kertje', 1), ('ĂśdĂĽlĹ‘falu', 1), ('Ă‰tterem', 1), ('Golser', 1), ('Hart', 1), ('Broadway', 1), ('Oceanic', 1), ('Rodeway', 1), ('Memphis', 1), ('Borneo', 1), ('Family', 2), ('Djogolanova', 1), ('Kashta', 1), ('Rochers', 1), ('Airlines', 1), ('Travel', 1), ('Violand', 1), ('Garden', 3), ('Time', 1), ('Biancas', 1), ('Fairfield', 1), ('Sudbury', 1), ('Red', 2), ('Roof', 2), ('Cleveland', 1), ('Medina', 1), ('Gasthof', 1), ('Velten', 1), ('Hospedaje', 1), ('Familiar', 1), ('Wetterstein', 1), ('Uozu', 1), ('Manten', 1), ('Ekimae', 1), ('Briar', 1), ('GĂ¤stehaus', 1), ('Panorama', 1), ('Sandnes', 1), ('Vandrerhjem', 1), ('Dormitory', 1), ('Silsil', 1), ('Kansas', 1), ('Nashville-I-24', 1), ('Hickory', 1), ('Hollow', 1), ('Courtyard', 1), ('Frederick', 1), ('Sai', 1), ('Ngeun', 1), ('Comfort', 1), ('Pittsburgh', 1), ('Zhalantun', 1), ('Qinhe', 1), ('Square', 1), ('Loharkar', 1), ('Familly', 1), ('DoĂ±a', 1), ('Lola', 1), ('1850', 1), ('James', 1), ('Joyce', 1), ('Coffetel', 1), ('Guiyang', 1), ('Xingdao', 1), ('Aippim', 1), ('y', 1), ('Joaquin', 1), ('Prime', 1), ('Akan', 1), ('Mori', 1), ('Hanayuuka', 1), ('Ceramica', 1), ('Lantian', 1), ('Wuhan', 1), ('SHADA', 1), ('ElHotel', 1), ('Malang', 1), ('Century', 2), ('Tianxiang', 1), ('Theme', 1), ('Il', 1), ('Palazzin', 1), ('Apolis', 1), ('Adria', 1), ('Mabre', 1), ('Takamatsu', 1), ('Auberge', 2), ('Des', 1), ('2', 2), ('Etangs', 1), ('Moderna', 1), ('CrepDeChine', 1), ('De', 1), ('Rhu', 1), ('Williamsburg', 1), ('Boardwalk', 1), ('Shri', 1), ('Radhe', 1), ('Krishna', 1), ('Dierks', 1), ('TRYP', 1), ('Wyndham', 2), ('Abu', 1), ('Dhabi', 1), ('Dongfanggong', 1), ('Beijing', 2), ('Profilaktoriy', 1), ('KMPO', 1), ('Slavyanskaya', 1), ('Traditsiya', 1), ('Brighton', 1), ('Esprit', 1), ('France', 1), ('AG', 1), ('GenX', 1), ('Sundaram,', 1), ('Haldwani', 1), ('Niagara', 1), ('7', 1), ('Salerno', 1), ('On', 3), ('Rydges', 1), ('Fortitude', 1), ('Valley', 2), ('VIVA', 1), ('Milano', 1), ('Diament', 1), ('Wroclaw', 1), ('Edda', 1), ('Egilsstadir', 1), ('Kenari', 1), ('Asri', 1), ('Palm', 1), ('Residency', 1), ('Txai', 1), ('Afrodita', 1), ('Swan', 1), ('Group', 1), ('Houseboats,', 1), ('Golden', 2), ('Esplendor', 1), ('Montevideo', 1), ('â€“', 1), ('Ping', 1), ('Seminyak', 1), ('Wadoma', 1), ('Royale', 1), ('BenkiraĎŠ', 1), ('Haifa', 1), ('Shunhe', 1), ('Yujia', 1), ('Stay', 1), ('Antwerp', 1), ('Harbour', 1), ('Merih', 1), ('Guesthouse', 2), ('MB', 1), ('Knezevic', 1), ('Sanqingshan', 1), ('Xilaideng', 1), ('Mary', 1), ('Centralny', 1), ('Nenghui', 1), ('Star', 2), ('Mini-Dacha', 1), ('Subang', 1), ('Khweza', 1), ('Bed', 1), ('Breakfast', 1), ('Mill', 1), ('Melnicata', 1), ('Hanseport', 1), ('Hamburg', 1), ('Rurales', 1), ('Antanielles', 1), ('les', 1), ('Grosses', 1), ('Pierres', 1), ('Nera', 1), ('Sahaa', 1), ('Windsor', 1), ('Contact', 1), ('Bagnoles', 1), ('Albergue', 1), ('Corredoiras', 1), ('Orchid', 1), ('Tel', 1), ('Aviv', 1), ('Jeddah', 1), ('Trident', 1), ('Lima', 1), ('Duva', 1), ('Radisson', 1), ('Albany', 1), ('Centra', 1), ('Splendid', 1), ('Krone', 1), ('Xinfulin', 1), ('Anurag', 1), ('Humboldt-Haus', 1), ('FĂŞnix', 1), ('Varginha', 1), ('Stara', 1), ('Polana', 1), ('Green', 1), ('Mansion', 1), ('Socim', 1), ('Verdi', 1), ('Lozenetz', 1), ('Treehouse', 1), ('Condos', 1), ('Marmotel', 1), ('Gite', 1), ('Flourou', 1), ('Econo', 1), ('Thunder', 1), ("Marriott's", 1), ('StreamSide', 1), ('Birch', 1), ('Vail', 1), ('Serendipity', 1), ('Lipe', 1), ('Radhakrishna', 1), ('Coral', 1), ('Forever', 1), ('Wuyishan', 1), ('Huanyu', 1), ('Tourist', 1), ('Dona', 1), ('Sofia', 1), ('Luz', 1), ('Arroyo', 1), ('Guang', 1), ('Ke', 1), ('Aspen', 1), ('Zaluuchuud', 1), ('Ulaanbaatar', 1), ('Khaosan', 1), ('Tokyo', 1), ('Kabuki', 1), ('Ballymaloe', 1), ('Biruza', 1), ('Stone', 1), ('Busan', 1), ('Haeundae', 1), ('Durban', 1), ('Manor', 1), ('Baeza', 1), ("l'autre", 1), ('jardin', 1), ('Kormoran', 1), ('Quinta', 1), ('Tumwater', 1), ('Kur-', 1), ('Sporthotel', 1), ('Interest', 1), ('Dog', 1), ('Doublet', 1), ('Belvedere', 1), ('O', 1), ('Portelo', 1), ('Rural', 1), ('AzurĂ¨va', 1), ('Grau', 1), ('Roi', 1), ('Plum', 1), ('Creek', 1), ('Wild', 1), ('Flower', 1), ('Chitose', 1), ('Apartaments', 1), ('Inter', 1), ('EsquĂ\xad', 1), ('Borgo', 1), ('Della', 1), ('Marmotta', 1), ('Kos', 1), ('Junior', 1), ('Barton', 1), ('Ximala', 1), ('Jia', 1), ('He', 1), ('Real', 1), ('Bella', 1), ('Bormon', 1), ('Lagoa', 1), ('Azul', 1), ('Seca', 1), ('Bonola', 1), ('S-centrum', 1), ('Relax', 1), ("A'Beckett", 1), ('Castel', 1), ('Ferari', 1), ('Viphaphone', 1), ('Seattle', 1), ('Angrense', 1), ('ibis', 1), ('Koblenz', 1), ('U', 1), ('Kaplicky', 1), ('Tongsai', 1), ('Party', 1), ('Youth', 1), ('Guangzhou', 1), ('Dagang', 1), ('Ciudad', 1), ('Media', 1), ('Catuai', 1), ('Lal', 1), ('Castle', 1), ('CabaĂ±as', 1), ('Arepo', 1), ('Barrancas', 1), ('Lolita', 1), ('Lanting', 1), ('Belveder', 1), ('Agli', 1), ('Olmi', 1)])

In [35]:
# transform into a data frame
word_count = pd.DataFrame({'word': [item[0] for item in list(word_count)], 
             'count' : [item[1] for item in list (word_count)]})
# name columns
word_count = word_count[['word', 'count']]
# format
word_count = word_count.sort_values('count', ascending = False)

In [36]:
word_count.head(10)

       word  count
7     Hotel    205
14      Inn     51
116       &     26
96   Resort     22
40      The     21
81   Suites     20
56        -     11
72       La     11
91    Beach     11
117     Spa     11

### Removing Stopwords

In [37]:
stopwords = word_count[word_count["count"]>=10]

In [38]:
stopwords

       word  count
7     Hotel    205
14      Inn     51
116       &     26
96   Resort     22
40      The     21
81   Suites     20
56        -     11
72       La     11
91    Beach     11
117     Spa     11
150     and     10

In [39]:
def remove_stopwords(input_string, stopwords_list): #define function that takes out stopwords from a list of strings and joins strings again
    my_string = []
    for word in input_string.split(): 
        if word not in stopwords_list: 
            my_string.append(word)

    return " ".join(my_string)

stopword_list = stopwords['word'].tolist()
accomodation["cut"] = accomodation['name'].apply(lambda row: remove_stopwords(row, stopword_list)) #apply to

In [40]:
accomodation["cut2"] = accomodation.name.str.split().apply(lambda x: " ".join([y for y in x if y not in list(stopwords["word"])]))
# SECOND METHOD

In [41]:
accomodation

,name,city,...,cut,cut2
0,Pensiunea Sovirag,Sic,...,Pensiunea Sovirag,Pensiunea Sovirag
1,Bio-Vitalhotel Falkenhof,Bad FĂĽssing,...,Bio-Vitalhotel Falkenhof,Bio-Vitalhotel Falkenhof
2,Duvan Hotell,Uppsala,...,Duvan Hotell,Duvan Hotell
3,Wessex Hotel,Street Nr Glastonbury,...,Wessex,Wessex
4,Alexandria Hotel,Thessaloniki,...,Alexandria,Alexandria
...,...,...,...,...,...
495,Casa Grande Boutique Hotel,Ciudad Bolivar,...,Casa Grande Boutique,Casa Grande Boutique
496,CabaĂ±as Arepo - Barrancas de Lolita,Areponapuchi,...,CabaĂ±as Arepo Barrancas de Lolita,CabaĂ±as Arepo Barrancas de Lolita
497,Lanting Inn,Dunhuang,...,Lanting,Lanting
498,Hotel Belveder,Pag,...,Belveder,Belveder
499,Hotel Agli Olmi,San Biagio Di Callalta,...,Agli Olmi,Agli Olmi

## Some Regex

In [42]:
data = [["mcdonalds split central22223 london"], ["pizza hut split downtown 3333new york"], ["dominos split new 2222jersey"], [ "mac donald split333 berlin"] ]

restaurants = pd.DataFrame(data, columns = ['restaurant_name'])

restaurants

                         restaurant_name
0    mcdonalds split central22223 london
1  pizza hut split downtown 3333new york
2           dominos split new 2222jersey
3             mac donald split333 berlin

In [117]:
restaurants["after"]=restaurants["restaurant_name"].str.replace('.*split',"") #match everything after
restaurants["before"] = restaurants["restaurant_name"].str.replace('split.*',"") #match everything before
restaurants["letters"] = restaurants["restaurant_name"].str.replace('[a-zA-Z]',"") #match letters only 
restaurants["numbers"] = restaurants["restaurant_name"].str.replace('[0-9]',"") #match numbers only

In [118]:
restaurants

,restaurant_name,before,after,letters,numbers
0,mcdonalds split central22223 london,mcdonalds,central22223 london,22223,mcdonalds split central london
1,pizza hut split downtown 3333new york,pizza hut,downtown 3333new york,3333,pizza hut split downtown new york
2,dominos split new 2222jersey,dominos,new 2222jersey,2222,dominos split new jersey
3,mac donald split333 berlin,mac donald,333 berlin,333,mac donald split berlin